app/Models/AuthenticationModel.php

SELECT *
FROM `user`
WHERE `email` = 'alejandro23dev@gmail.com'
AND `deleted` = 0
---
	public function login($email, $password)
	{
		$query = $this->db->table('user')
			->where('email', $email)
			->where('deleted', 0);

		$data = $query->get()->getResult();