app/Models/ChatsModel.php

SELECT *
FROM `user`
WHERE `id` != '2'
---
	public function getContacts($logUserID)
	{
		$query = $this->db->table('user')
			->where('id!=', $logUserID);

		return $query->get()->getResult();